-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2022-12-10 05:31:11
-- サーバのバージョン： 10.4.24-MariaDB
-- PHP のバージョン: 8.0.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `healthylife`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `name_of_disease`
--

CREATE TABLE `name_of_disease` (
  `id` int(11) NOT NULL COMMENT 'ID',
  `name_id` int(11) DEFAULT NULL COMMENT '病名ID',
  `name_of_disease` varchar(255) DEFAULT NULL COMMENT '病名',
  `information` text DEFAULT NULL COMMENT '症状',
  `link` varchar(1000) DEFAULT NULL COMMENT '参考リンク',
  `is_deleted` tinyint(4) NOT NULL DEFAULT 0 COMMENT '削除フラグ',
  `create_date_time` datetime NOT NULL DEFAULT current_timestamp() COMMENT '登録日時',
  `update_date_time` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `name_of_disease`
--

INSERT INTO `name_of_disease` (`id`, `name_id`, `name_of_disease`, `information`, `link`, `is_deleted`, `create_date_time`, `update_date_time`) VALUES
(1, 1, '風邪', '風邪は、正式には「風邪症候群」といって、一般的にくしゃみ、鼻水、鼻づまり、のどの痛み、咳、たん、発熱などの症状の総称を指します。', 'https://toda-jibika.jp/1657-2', 0, '2022-10-27 10:29:00', '2022-11-18 11:23:53'),
(2, 2, 'インフルエンザ', 'インフルエンザは、インフルエンザウイルスに感染することによって発症します。毎年、冬になると患者さんが多くなり、1月の第4週・第5週ごろに流行のピークを迎えることが多いです。\n\n主な感染経路は、くしゃみ・せき・会話などです。感染者の口から発せられたウイルスを含んだ飛沫を吸い込み、ウイルスが鼻や喉の粘膜に付着することによって起こる飛沫感染です。症状として、感染してから1～5日後に突然38℃以上の発熱と、頭痛や関節痛、筋肉痛などの体の痛みが起こり、さらに鼻汁、せき、のどの痛みなどが生じます。', 'https://www.saiseikai.or.jp/medical/disease/influenza/', 0, '2022-11-01 10:20:51', '2022-11-18 11:21:01'),
(3, 3, 'コロナ', 'ヒトに感染するコロナウイルスは、風邪の病原体として人類に広く蔓延している４種類と、動物から感染した重症肺炎ウイルス２種類が知られている。', 'https://www.niid.go.jp/niid/ja/kansennohanashi/9303-coronavirus.html', 0, '2022-11-01 10:56:14', '2022-11-18 11:26:23'),
(4, 40000, 'ssssa', 'sss', 'kkkk', 1, '2022-11-03 11:34:19', '2022-11-18 14:45:26'),
(5, 5, '55555', '555555', '', 1, '2022-11-03 11:34:33', '2022-11-11 10:07:47'),
(6, 6, 'kkkk', 'llll', '', 1, '2022-11-08 11:50:50', '2022-11-18 14:45:21'),
(7, 7, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-10 15:24:02', '2022-11-18 11:28:06'),
(8, 8, 'kkoo88', 'kkoolll', 'nnnn', 1, '2022-11-10 15:24:13', '2022-11-17 14:03:26'),
(9, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-10 15:34:22', '2022-11-18 11:28:13'),
(10, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-10 15:34:22', '2022-11-17 14:24:19'),
(11, 11, '1213', '1213jjj', 'dd', 1, '2022-11-10 15:34:22', '2022-11-18 11:28:17'),
(12, 12, 'jjjj', 'jjjjsss', 'aaaa', 1, '2022-11-10 15:34:22', '2022-11-18 11:28:20'),
(13, 13, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-10 15:37:08', '2022-11-18 11:28:23'),
(14, 14, 'uuui', 'uuui', 'vvv', 1, '2022-11-10 15:37:08', '2022-11-18 11:28:26'),
(15, 15, '1213', '1213jjj', 'dd', 1, '2022-11-10 15:37:08', '2022-11-17 14:24:11'),
(16, 16, 'jjjj', 'jjjjsss', 'aaaa', 1, '2022-11-10 15:37:08', '2022-11-18 11:28:36'),
(17, 12131, '3242424', 'dasfa', '', 1, '2022-11-16 13:59:01', '2022-11-18 14:45:08'),
(18, 333, 'opkok', 'okoj		', '', 1, '2022-11-16 14:46:46', '2022-11-18 14:45:12'),
(19, 90000, '発熱', '発熱とは、体温が上昇している状態のことをいいます。私たちの体温は、通常時は脳内の視床下部にある「体温調節中枢」の働きによって、一定の範囲(平熱)に保たれています。ところが、さまざまな原因によって体温調節中枢の設定温度が高くなると、発熱が生じます', 'https://www.saiseikai.or.jp/medical/symptom/fever/', 0, '2022-11-17 11:46:12', '2022-11-17 11:46:12'),
(20, 99999, '心配の必要なし', '大病の可能性がないので、安静にしていれば治ります。', '', 0, '2022-11-17 14:17:33', '2022-11-17 14:17:33'),
(21, 91000, '症状のキーワードなし', '症状のキーとなる言葉を入力してください', '', 0, '2022-11-17 14:22:00', '2022-11-18 11:09:49'),
(22, 5, 'bbb', 'jjjjjj', '', 0, '2022-11-18 15:10:51', '2022-11-18 15:10:51'),
(23, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-18 15:15:25', '2022-11-19 13:14:02'),
(24, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-18 15:15:25', '2022-11-19 13:14:26'),
(25, 11, '1213', '1213jjj', 'dd', 1, '2022-11-18 15:15:25', '2022-11-19 13:14:18'),
(26, 12, 'jjjjkk', 'jjjjsss', 'aaaa', 1, '2022-11-18 15:15:25', '2022-11-23 14:37:17'),
(27, 8888, 'jkjad', ';ljda;l', '', 1, '2022-11-19 13:14:51', '2022-11-23 14:37:21'),
(28, 1, 'aa', 'jjj', '', 1, '2022-11-19 13:15:21', '2022-11-19 13:15:32'),
(29, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-23 14:39:48', '2022-11-23 14:40:32'),
(30, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-23 14:39:48', '2022-11-23 14:40:36'),
(31, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-23 14:40:12', '2022-11-23 14:40:38'),
(32, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-23 14:40:12', '2022-11-23 14:40:40'),
(33, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-23 14:41:06', '2022-11-23 15:01:02'),
(34, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-23 14:41:06', '2022-11-23 15:01:06'),
(35, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-23 15:21:25', '2022-11-24 10:25:48'),
(36, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-23 15:21:25', '2022-11-24 11:34:46'),
(37, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 11:30:37', '2022-11-24 11:34:50'),
(38, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 11:30:37', '2022-11-24 11:34:54'),
(39, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 11:35:19', '2022-11-24 11:42:17'),
(40, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 11:35:19', '2022-11-24 11:42:20'),
(41, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 11:42:27', '2022-11-24 11:46:24'),
(42, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 11:42:27', '2022-11-24 11:46:28'),
(43, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 11:46:41', '2022-11-24 13:00:17'),
(44, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 11:46:41', '2022-11-24 13:00:21'),
(45, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 11:48:56', '2022-11-24 13:00:24'),
(46, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 11:48:56', '2022-11-24 13:00:28'),
(47, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 13:19:57', '2022-11-24 13:25:48'),
(48, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 13:19:57', '2022-11-24 13:25:57'),
(49, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 13:41:41', '2022-11-24 13:42:19'),
(50, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 13:41:41', '2022-11-24 13:42:21'),
(51, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 13:45:38', '2022-11-24 13:49:47'),
(52, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 13:45:38', '2022-11-24 13:49:50'),
(53, 9, 'kkoo', 'kkoolll', 'nnnn', 1, '2022-11-24 13:49:11', '2022-11-24 13:49:52'),
(54, 10, 'uuui', 'uuui', 'vvv', 1, '2022-11-24 13:49:11', '2022-11-24 13:49:55'),
(55, 9, 'kkoo', 'kkoolll', 'nnnn', 0, '2022-11-24 13:56:51', '2022-11-24 13:56:51'),
(56, 10, 'uuui', 'uuui', 'vvv', 0, '2022-11-24 13:56:51', '2022-11-24 13:56:51'),
(57, 9, 'kkoo', 'kkoolll', 'nnnn', 0, '2022-11-24 13:59:32', '2022-11-24 13:59:32'),
(58, 10, 'uuui', 'uuui', 'vvv', 0, '2022-11-24 13:59:32', '2022-11-24 13:59:32');

-- --------------------------------------------------------

--
-- テーブルの構造 `result`
--

CREATE TABLE `result` (
  `id` int(11) NOT NULL COMMENT 'ID',
  `result_id` int(11) DEFAULT NULL COMMENT '結果ID',
  `comment` text DEFAULT NULL COMMENT '総評',
  `is_deleted` tinyint(4) NOT NULL DEFAULT 0 COMMENT '削除フラグ',
  `create_date_time` datetime NOT NULL DEFAULT current_timestamp() COMMENT '登録日時',
  `update_date_time` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新日時',
  `result1_probability` tinyint(4) DEFAULT NULL COMMENT '結果1確率',
  `result1_name_id` int(11) DEFAULT NULL COMMENT '結果1病名ID',
  `result2_probability` tinyint(4) DEFAULT NULL COMMENT '結果2確率',
  `result2_name_id` int(11) DEFAULT NULL COMMENT '結果2病名ID',
  `result3_probability` tinyint(4) DEFAULT NULL COMMENT '結果3確率',
  `result3_name_id` int(11) DEFAULT NULL COMMENT '結果3病名ID',
  `result4_probability` tinyint(4) DEFAULT NULL COMMENT '結果4確率',
  `result4_name_id` int(11) DEFAULT NULL COMMENT '結果4病名ID',
  `result5_probability` tinyint(4) DEFAULT NULL COMMENT '結果5確率',
  `result5_name_id` int(11) DEFAULT NULL COMMENT '結果5病名ID',
  `result6_probability` tinyint(4) DEFAULT NULL COMMENT '結果6確率',
  `result6_name_id` int(11) DEFAULT NULL COMMENT '結果6病名ID',
  `result7_probability` tinyint(4) DEFAULT NULL COMMENT '結果7確率',
  `result7_name_id` int(11) DEFAULT NULL COMMENT '結果7病名ID',
  `result8_probability` tinyint(4) DEFAULT NULL COMMENT '結果8確率',
  `result8_name_id` int(11) DEFAULT NULL COMMENT '結果8病名ID',
  `result9_probability` tinyint(4) DEFAULT NULL COMMENT '結果9確率',
  `result9_name_id` int(11) DEFAULT NULL COMMENT '結果9病名ID',
  `result10_probability` tinyint(4) DEFAULT NULL COMMENT '結果10確率',
  `result10_name_id` int(11) DEFAULT NULL COMMENT '結果10病名ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `result`
--

INSERT INTO `result` (`id`, `result_id`, `comment`, `is_deleted`, `create_date_time`, `update_date_time`, `result1_probability`, `result1_name_id`, `result2_probability`, `result2_name_id`, `result3_probability`, `result3_name_id`, `result4_probability`, `result4_name_id`, `result5_probability`, `result5_name_id`, `result6_probability`, `result6_name_id`, `result7_probability`, `result7_name_id`, `result8_probability`, `result8_name_id`, `result9_probability`, `result9_name_id`, `result10_probability`, `result10_name_id`) VALUES
(1, 1, '風邪と思われますが、医師の診断をすすめます。', 0, '2022-10-27 10:30:05', '2022-11-18 11:32:10', 90, 1, 80, 2, 70, 3, 65, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(2, 2, '早急に医師に診てもらったほうがよいです。', 0, '2022-11-02 10:19:31', '2022-11-18 11:32:52', 80, 2, 75, 1, 60, 3, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(3, 3, 'あまり心配することないでしょう。安静にしましょう。', 0, '2022-11-02 10:20:10', '2022-11-18 11:31:07', 40, 3, 30, 1, 10, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(4, 4, 'コロナが疑われるので、発熱外来を受けてください。', 0, '2022-11-02 10:20:50', '2022-11-18 11:34:31', 70, 3, 60, 1, 55, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(5, 5, 'インフルエンザの可能性が高いので、医師に診てもらったほうがよいです。', 0, '2022-11-02 10:21:27', '2022-11-18 11:33:37', 80, 2, 40, 3, 15, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(6, 0, '異常ありません', 0, '2022-11-17 15:17:25', '2022-11-19 11:30:12', 100, 21, 100, 21, 100, 21, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- テーブルの構造 `users`
--

CREATE TABLE `users` (
  `id` bigint(20) NOT NULL COMMENT 'ID',
  `user_id` bigint(20) NOT NULL COMMENT 'ユーザーID',
  `mail_address` varchar(100) DEFAULT NULL COMMENT 'メールアドレス',
  `password` varchar(100) DEFAULT NULL COMMENT 'パスワード',
  `birthday` date DEFAULT NULL COMMENT '生年月日',
  `sex` tinyint(4) NOT NULL DEFAULT 0 COMMENT '性別',
  `country` varchar(3) NOT NULL DEFAULT 'JP' COMMENT '国籍',
  `is_ai_search` tinyint(4) NOT NULL DEFAULT 0 COMMENT 'AIフラグ',
  `is_withdrawaled` tinyint(4) NOT NULL DEFAULT 0 COMMENT '退会フラグ',
  `is_deleted` tinyint(4) NOT NULL DEFAULT 0 COMMENT '削除フラグ',
  `create_date_time` datetime NOT NULL DEFAULT current_timestamp() COMMENT '登録日時',
  `update_date_time` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新日時'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `users`
--

INSERT INTO `users` (`id`, `user_id`, `mail_address`, `password`, `birthday`, `sex`, `country`, `is_ai_search`, `is_withdrawaled`, `is_deleted`, `create_date_time`, `update_date_time`) VALUES
(1, 1, 'admin', '1234', '2000-01-01', 0, 'JP', 0, 0, 0, '2022-10-21 11:19:29', '2022-10-21 11:27:05'),
(2, 3, 'a@gmail.com', '1234', '2000-01-01', 0, 'JP', 0, 0, 0, '2022-10-21 11:24:59', '2022-11-19 11:38:34'),
(5, 5, 'b@gmail.com', '1234', '2014-10-01', 0, 'JP', 0, 0, 0, '2022-10-21 11:26:15', '2022-10-28 15:00:40'),
(12, 7, 'c@gmail.com', 'Aa12345678', '1987-10-24', 1, 'JP', 0, 1, 0, '2022-10-31 10:30:29', '2022-11-11 14:26:09'),
(13, 8, 'd@gmail.com', 'Aa123456', '2022-10-04', 1, 'JP', 0, 0, 0, '2022-10-31 14:22:30', '2022-10-31 14:22:30'),
(14, 9, 'e@gmail.com', 'Aa1234567', '1992-02-12', 0, 'JP', 0, 0, 0, '2022-11-08 11:47:59', '2022-11-11 11:42:46'),
(15, 10, 'bb@gmail.com', 'Aa123456', '2022-11-01', 0, 'JP', 0, 0, 0, '2022-11-15 13:20:36', '2022-11-15 13:48:30'),
(16, 1000, 'cbb@gmail.com', 'Aa123456', '2022-11-01', 0, 'JP', 0, 0, 0, '2022-11-15 13:40:58', '2022-11-15 13:40:58'),
(17, 1001, 'cffc@gmail.com', 'Aa123456', '1910-01-01', 1, 'JP', 0, 0, 0, '2022-11-15 13:45:02', '2022-11-15 13:48:25'),
(18, 18, 'dkk@gmail.com', 'Aa123456', '1987-02-01', 0, 'JP', 0, 0, 1, '2022-11-15 13:47:42', '2022-12-10 13:23:34'),
(19, 19, 'cdk@gmail.com', 'kkKoi9892133', '2022-11-01', 1, 'JP', 0, 0, 1, '2022-11-16 11:01:32', '2022-12-10 13:23:39'),
(20, 20, 'dLLLLL@gmail.com', 'Aa123456', '1999-01-01', 0, 'JP', 0, 0, 1, '2022-11-18 15:41:51', '2022-12-10 13:23:42'),
(21, 21, 'dhhh@gmail.com', 'Aa12345888', '2022-02-19', 0, 'JP', 0, 0, 1, '2022-11-19 13:36:54', '2022-12-10 13:23:47'),
(22, 22, 'd@gmail.com', 'Aa12345678', '1988-02-12', 1, 'JP', 0, 0, 1, '2022-11-19 14:07:56', '2022-12-10 13:23:53');

-- --------------------------------------------------------

--
-- テーブルの構造 `user_search`
--

CREATE TABLE `user_search` (
  `id` bigint(20) NOT NULL COMMENT 'ID',
  `user_id` bigint(20) NOT NULL COMMENT 'ユーザーID',
  `mark` tinyint(4) NOT NULL DEFAULT 0 COMMENT 'お気に入りマーク',
  `search_date` date DEFAULT NULL COMMENT '検索日',
  `word` varchar(100) DEFAULT NULL COMMENT '検索ワード',
  `is_deleted` tinyint(4) NOT NULL DEFAULT 0 COMMENT '削除フラグ',
  `create_date_time` datetime NOT NULL DEFAULT current_timestamp() COMMENT '登録日時',
  `update_date_time` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新日時',
  `result1_probability` tinyint(4) DEFAULT NULL COMMENT '結果1確率',
  `result1_name_id` int(11) DEFAULT NULL COMMENT '結果1病名ID',
  `result2_probability` tinyint(4) DEFAULT NULL COMMENT '結果2確率',
  `result2_name_id` int(11) DEFAULT NULL COMMENT '結果2病名ID',
  `result3_probability` tinyint(4) DEFAULT NULL COMMENT '結果3確率',
  `result3_name_id` int(11) DEFAULT NULL COMMENT '結果3病名ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `user_search`
--

INSERT INTO `user_search` (`id`, `user_id`, `mark`, `search_date`, `word`, `is_deleted`, `create_date_time`, `update_date_time`, `result1_probability`, `result1_name_id`, `result2_probability`, `result2_name_id`, `result3_probability`, `result3_name_id`) VALUES
(1, 3, 0, '2022-10-25', 'test', 1, '2022-10-27 10:31:30', '2022-11-08 11:46:16', 90, 1, 80, 2, 70, 3),
(2, 3, 1, '2022-10-26', 'test2', 1, '2022-10-27 10:32:19', '2022-11-18 11:12:50', 80, 2, 75, 3, 70, 1),
(3, 5, 0, '2022-10-27', 'test5', 0, '2022-10-27 14:22:50', '2022-10-27 14:22:50', 90, 2, 80, 1, 30, 3),
(4, 3, 0, '2022-11-01', 'aaa lll hhh', 1, '2022-11-02 10:22:56', '2022-11-18 11:13:42', 80, 3, 70, 2, 55, 1),
(5, 3, 1, '2022-11-07', 'aaa sss', 1, '2022-11-07 10:43:11', '2022-11-08 11:38:08', 90, 1, 80, 2, 70, 3),
(6, 3, 0, '2022-11-07', 'aaa sss', 1, '2022-11-07 10:43:45', '2022-11-14 10:17:56', 70, 3, 60, 1, 55, 2),
(7, 3, 0, '2022-11-07', '5', 1, '2022-11-07 10:51:11', '2022-11-07 11:46:15', 40, 3, 30, 1, 10, 2),
(8, 3, 1, '2022-11-07', '5', 1, '2022-11-07 10:51:16', '2022-11-14 10:17:52', 70, 3, 60, 1, 55, 2),
(9, 3, 0, '2022-11-07', 'g', 1, '2022-11-07 11:50:51', '2022-11-07 14:43:38', 70, 3, 60, 1, 55, 2),
(10, 3, 0, '2022-11-07', 'こ', 1, '2022-11-07 11:51:29', '2022-11-07 14:45:07', 70, 3, 60, 1, 55, 2),
(11, 3, 0, '2022-11-07', 'g', 1, '2022-11-07 14:43:08', '2022-11-08 10:43:50', 70, 3, 60, 1, 55, 2),
(12, 3, 0, '2022-11-07', 'aaa sss', 1, '2022-11-07 14:48:55', '2022-11-07 15:32:52', 90, 1, 80, 2, 70, 3),
(13, 3, 0, '2022-11-07', 'aaa sss', 1, '2022-11-07 14:52:39', '2022-11-07 15:32:27', 90, 1, 80, 2, 70, 3),
(14, 3, 0, '2022-11-07', 'aaa sss', 1, '2022-11-07 14:55:40', '2022-11-07 15:32:19', 90, 1, 80, 2, 70, 3),
(15, 3, 0, '2022-11-07', 'aaa sss', 1, '2022-11-07 14:56:40', '2022-11-07 15:32:23', 40, 3, 30, 1, 10, 2),
(16, 3, 0, '2022-11-07', 'aaa ss', 1, '2022-11-07 15:07:10', '2022-11-07 15:32:46', 80, 2, 75, 1, 60, 3),
(17, 3, 0, '2022-11-07', 'aaa s', 1, '2022-11-07 15:07:56', '2022-11-07 15:32:44', 80, 2, 75, 1, 60, 3),
(18, 3, 0, '2022-11-07', 'aaa s', 1, '2022-11-07 15:08:54', '2022-11-07 15:32:55', 70, 3, 60, 1, 55, 2),
(19, 3, 0, '2022-11-08', 'aaa', 1, '2022-11-08 10:41:24', '2022-11-08 11:16:48', 40, 3, 30, 1, 10, 2),
(20, 3, 0, '2022-11-08', 'g', 1, '2022-11-08 10:42:48', '2022-11-08 11:38:03', 90, 1, 80, 2, 70, 3),
(21, 3, 0, '2022-11-08', 'aaa sss', 1, '2022-11-08 10:53:40', '2022-11-08 11:16:58', 80, 2, 75, 1, 60, 3),
(22, 3, 0, '2022-11-08', 'aaa sss', 1, '2022-11-08 11:01:18', '2022-11-08 11:16:53', 40, 3, 30, 1, 10, 2),
(23, 3, 0, '2022-11-08', 'g', 1, '2022-11-08 11:05:18', '2022-11-08 11:16:50', 40, 3, 30, 1, 10, 2),
(24, 3, 0, '2022-11-08', 'aaa', 1, '2022-11-08 11:05:32', '2022-11-17 14:44:30', 90, 1, 80, 2, 70, 3),
(25, 3, 0, '2022-11-08', 'aa', 1, '2022-11-08 11:07:02', '2022-11-08 11:38:00', 80, 2, 75, 1, 60, 3),
(26, 3, 0, '2022-11-08', '5', 1, '2022-11-08 11:13:27', '2022-11-08 11:14:07', 40, 3, 30, 1, 10, 2),
(27, 3, 0, '2022-11-08', 'aaa', 1, '2022-11-08 11:31:29', '2022-11-08 11:37:56', 40, 3, 30, 1, 10, 2),
(28, 3, 0, '2022-11-08', '5444', 1, '2022-11-08 11:38:16', '2022-11-08 11:38:23', 90, 1, 80, 2, 70, 3),
(29, 3, 0, '2022-11-08', 'こ', 1, '2022-11-08 11:40:15', '2022-11-08 11:40:19', 70, 3, 60, 1, 55, 2),
(30, 3, 1, '2022-11-08', 'lll', 1, '2022-11-08 11:43:07', '2022-11-18 11:12:54', 70, 3, 60, 1, 55, 2),
(31, 3, 0, '2022-11-14', 'aaa sss', 1, '2022-11-14 09:54:01', '2022-11-17 10:40:04', 70, 3, 60, 1, 55, 2),
(32, 3, 1, '2022-11-14', 'g', 1, '2022-11-14 10:11:07', '2022-11-17 14:30:12', 80, 2, 75, 1, 60, 3),
(33, 3, 0, '2022-11-14', 'aaa sss', 1, '2022-11-14 10:22:32', '2022-11-17 10:40:06', 40, 3, 30, 1, 10, 2),
(34, 3, 0, '2022-11-17', '頭　痛い', 1, '2022-11-17 10:39:51', '2022-11-17 14:44:25', 70, 3, 60, 1, 55, 2),
(35, 3, 0, '2022-11-17', 'kk', 1, '2022-11-17 11:01:03', '2022-11-17 11:15:46', 40, 3, 30, 1, 10, 2),
(36, 3, 0, '2022-11-17', 'lolll', 1, '2022-11-17 11:11:50', '2022-11-17 11:15:47', 80, 2, 75, 1, 60, 3),
(37, 3, 0, '2022-11-17', 'sad', 1, '2022-11-17 11:12:45', '2022-11-17 14:14:23', 80, 2, 75, 1, 60, 3),
(38, 3, 0, '2022-11-17', 'aaa', 1, '2022-11-17 11:15:33', '2022-11-17 11:15:43', 80, 2, 75, 1, 60, 3),
(39, 3, 0, '2022-11-17', 'g', 1, '2022-11-17 11:57:40', '2022-11-17 14:14:22', 80, 2, 75, 1, 60, 3),
(40, 3, 1, '2022-11-17', '熱　38度', 1, '2022-11-17 14:14:38', '2022-11-18 15:09:15', 80, 2, 75, 1, 60, 3),
(41, 3, 0, '2022-11-17', 'aaa sss', 1, '2022-11-17 14:30:48', '2022-11-17 14:33:27', 70, 3, 60, 1, 55, 2),
(42, 3, 0, '2022-11-17', 'g', 1, '2022-11-17 14:33:33', '2022-11-17 14:44:24', 90, 1, 80, 2, 70, 3),
(43, 3, 0, '2022-11-17', 'g', 1, '2022-11-17 14:39:41', '2022-11-17 14:44:28', 80, 2, 75, 1, 60, 3),
(44, 3, 0, '2022-11-17', 'g', 1, '2022-11-17 14:39:52', '2022-11-17 14:44:27', 40, 3, 30, 1, 10, 2),
(45, 3, 0, '2022-11-17', 'aaa sss', 1, '2022-11-17 14:44:34', '2022-11-17 15:10:35', 70, 3, 60, 1, 55, 2),
(46, 3, 0, '2022-11-17', 'aaa', 1, '2022-11-17 14:44:47', '2022-11-17 14:45:14', 80, 2, 75, 1, 60, 3),
(47, 3, 0, '2022-11-17', 'aaa', 1, '2022-11-17 14:44:57', '2022-11-17 14:45:28', 40, 3, 30, 1, 10, 2),
(48, 3, 0, '2022-11-17', 'aaa', 1, '2022-11-17 14:45:32', '2022-11-17 15:20:32', 80, 2, 75, 1, 60, 3),
(49, 3, 0, '2022-11-17', 'g', 1, '2022-11-17 15:09:10', '2022-11-17 15:10:21', 40, 3, 30, 1, 10, 2),
(50, 3, 0, '2022-11-17', '熱　頭　痛い', 0, '2022-11-17 15:09:39', '2022-11-17 15:09:39', 90, 1, 80, 2, 70, 3),
(51, 3, 0, '2022-11-17', '熱　頭　痛い', 1, '2022-11-17 15:09:47', '2022-11-17 15:38:04', 40, 3, 30, 1, 10, 2),
(52, 3, 0, '2022-11-17', '熱　頭　痛い', 0, '2022-11-17 15:09:52', '2022-11-17 15:09:52', 80, 2, 75, 1, 60, 3),
(53, 3, 0, '2022-11-17', '5', 1, '2022-11-17 15:20:37', '2022-11-17 15:22:17', 100, 91000, 100, 91000, 100, 91000),
(54, 3, 0, '2022-11-17', 'g', 1, '2022-11-17 15:22:53', '2022-11-17 15:37:59', 100, 91000, 100, 91000, 100, 91000),
(55, 3, 0, '2022-11-17', '熱　しんどい', 1, '2022-11-17 15:25:20', '2022-11-19 13:12:08', 80, 2, 75, 1, 60, 3),
(56, 3, 0, '2022-11-17', 'aaa', 1, '2022-11-17 15:30:12', '2022-11-17 15:38:01', 100, 91000, 100, 91000, 100, 91000),
(57, 3, 0, '2022-11-17', 'aaa sss', 1, '2022-11-17 15:37:49', '2022-11-17 15:38:02', 100, 91000, 100, 91000, 100, 91000),
(58, 3, 0, '2022-11-17', 'aaa sss', 1, '2022-11-17 15:41:47', '2022-11-18 11:06:03', 100, 91000, 100, 91000, 100, 91000),
(59, 3, 0, '2022-11-17', 'aaa sss', 1, '2022-11-17 15:44:21', '2022-11-18 15:09:17', 100, 91000, 100, 91000, 100, 91000),
(60, 3, 1, '2022-11-18', '熱　一週間　だるい', 1, '2022-11-18 11:13:16', '2022-11-18 11:17:06', 80, 2, 75, 1, 60, 3),
(61, 3, 1, '2022-11-18', '39度以上　体がだるい', 0, '2022-11-18 11:16:52', '2022-11-18 11:17:01', 90, 1, 80, 2, 70, 3),
(62, 3, 1, '2022-11-18', '熱　なかなか下がらない', 0, '2022-11-18 11:36:05', '2022-11-18 11:36:22', 80, 2, 75, 1, 60, 3),
(63, 3, 1, '2022-11-18', '熱　一週間　だるい', 1, '2022-11-18 15:07:38', '2022-11-19 12:27:59', 40, 3, 30, 1, 10, 2),
(64, 3, 0, '2022-11-18', 'aaa', 1, '2022-11-18 15:07:59', '2022-11-19 12:27:23', 100, 21, 100, 21, 100, 21),
(65, 3, 0, '2022-11-18', '熱', 1, '2022-11-18 15:08:21', '2022-11-19 12:27:45', 40, 3, 30, 1, 10, 2),
(66, 3, 0, '2022-11-19', 'aaa', 1, '2022-11-19 11:49:47', '2022-11-19 12:27:37', 100, 21, 100, 21, 100, 21),
(67, 3, 0, '2022-11-19', '熱　しんどい', 1, '2022-11-19 11:53:18', '2022-11-19 12:28:05', 80, 2, 75, 1, 60, 3),
(68, 3, 0, '2022-11-19', 'g', 1, '2022-11-19 11:53:33', '2022-11-19 12:27:40', 100, 21, 100, 21, 100, 21),
(69, 3, 0, '2022-11-19', 'g', 1, '2022-11-19 11:54:34', '2022-11-19 12:27:34', 100, 21, 100, 21, 100, 21),
(70, 3, 0, '2022-11-19', 'ｇｇ', 1, '2022-11-19 11:54:45', '2022-11-19 12:27:48', 100, 21, 100, 21, 100, 21),
(71, 3, 0, '2022-11-19', '熱', 1, '2022-11-19 11:55:13', '2022-11-19 12:28:36', 80, 2, 75, 1, 60, 3),
(72, 3, 0, '2022-11-19', 'aaa', 1, '2022-11-19 12:02:43', '2022-11-19 12:27:31', 100, 21, 100, 21, 100, 21),
(73, 3, 0, '2022-11-19', 'aaa', 1, '2022-11-19 12:17:54', '2022-11-19 12:27:28', 100, 21, 100, 21, 100, 21),
(74, 3, 0, '2022-11-19', 'aaa', 1, '2022-11-19 12:26:51', '2022-11-19 12:27:51', 100, 21, 100, 21, 100, 21),
(75, 3, 0, '2022-11-19', '熱　続く', 0, '2022-11-19 12:28:18', '2022-11-19 12:28:18', 80, 2, 75, 1, 60, 3),
(76, 3, 0, '2022-11-19', 'しんどい　熱　長い', 0, '2022-11-19 12:28:49', '2022-11-19 12:28:49', 40, 3, 30, 1, 10, 2),
(77, 3, 0, '2022-11-19', 'ｍｍｍ', 0, '2022-11-19 12:29:04', '2022-11-19 12:29:04', 100, 21, 100, 21, 100, 21),
(78, 3, 0, '2022-11-19', '倦怠感　熱', 1, '2022-11-19 13:12:32', '2022-11-19 13:12:49', 40, 3, 30, 1, 10, 2),
(79, 3, 0, '2022-11-19', '倦怠感　熱', 0, '2022-11-19 13:12:58', '2022-11-19 13:12:58', 90, 1, 80, 2, 70, 3),
(80, 3, 0, '2022-11-19', '熱　', 1, '2022-11-19 13:47:14', '2022-11-21 10:17:42', 80, 2, 75, 1, 60, 3),
(81, 3, 0, '2022-11-21', 'aaa', 1, '2022-11-21 14:49:03', '2022-11-21 14:49:10', 100, 21, 100, 21, 100, 21),
(82, 3, 0, '2022-11-22', '熱', 0, '2022-11-22 10:07:49', '2022-11-22 10:07:49', 90, 1, 80, 2, 70, 3),
(83, 3, 0, '2022-11-24', '熱　頭　痛い', 0, '2022-11-24 14:32:53', '2022-11-24 14:32:53', 70, 3, 60, 1, 55, 2);

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `name_of_disease`
--
ALTER TABLE `name_of_disease`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `result`
--
ALTER TABLE `result`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `user_search`
--
ALTER TABLE `user_search`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `name_of_disease`
--
ALTER TABLE `name_of_disease`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=59;

--
-- テーブルの AUTO_INCREMENT `result`
--
ALTER TABLE `result`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=7;

--
-- テーブルの AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=23;

--
-- テーブルの AUTO_INCREMENT `user_search`
--
ALTER TABLE `user_search`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=84;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
